Reports/УдалитьОтчетПоНаличиюСчетовФактурПолученных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>УдалитьОтчетПоНаличиюСчетовФактурПолученных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеСчетаФактуры</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаСтруктурныхЕдиниц</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/Сторнирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Сторнирование</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.АктОбОказанииПроизводственныхУслуг</xr:Item>
				<xr:Item>Document.ВводНачальныхОстатковОС</xr:Item>
				<xr:Item>Document.ВводНачальныхОстатковПоЗарплате</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.ВыработкаНМА</xr:Item>
				<xr:Item>Document.ВыработкаОС</xr:Item>
				<xr:Item>Document.ГТДИмпорт</xr:Item>
				<xr:Item>Document.ДвижениеНЗП</xr:Item>
				<xr:Item>Document.ДепонированиеЗаработнойПлаты</xr:Item>
				<xr:Item>Document.ЗакрытиеДтКтЗадолженности</xr:Item>
				<xr:Item>Document.ЗакрытиеМесяца</xr:Item>
				<xr:Item>Document.КомплектацияНоменклатуры</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.НачислениеЗарплатыРаботникамОрганизаций</xr:Item>
				<xr:Item>Document.ОперацияБух</xr:Item>
				<xr:Item>Document.КорректировкаЗаписейРегистров</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ОтражениеЗарплатыВРеглУчете</xr:Item>
				<xr:Item>Document.ОтчетПроизводстваЗаСмену</xr:Item>
				<xr:Item>Document.ПередачаНМА</xr:Item>
				<xr:Item>Document.ПередачаОС</xr:Item>
				<xr:Item>Document.ПередачаТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ПереоценкаВнеоборотныхАктивов</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеВходящее</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.ПлатежныйОрдерПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПлатежныйОрдерСписаниеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеИзПереработки</xr:Item>
				<xr:Item>Document.ПоступлениеНМА</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПринятиеКУчетуОС</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасчетНалоговПриПоступленииАктивовУслуг</xr:Item>
				<xr:Item>Document.РасчетПениОПВиСО</xr:Item>
				<xr:Item>Document.РасчетСНиСО</xr:Item>
				<xr:Item>Document.РасчетУдержанийРаботниковОрганизаций</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.РеализацияУслугПоПереработке</xr:Item>
				<xr:Item>Document.РегистрацияПрочихДоходовВЦеляхНалогообложения</xr:Item>
				<xr:Item>Document.РегистрацияРазовыхУдержанийРаботниковОрганизаций</xr:Item>
				<xr:Item>Document.СписаниеНМА</xr:Item>
				<xr:Item>Document.СписаниеОС</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.Сторнирование</xr:Item>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
				<xr:Item>Document.УдержаниеИПНиОПВНУ</xr:Item>
				<xr:Item>Document.РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС</xr:Item>
				<xr:Item>Document.РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС</xr:Item>
				<xr:Item>Document.ДоговорНаВыполнениеРаботСФизЛицом</xr:Item>
				<xr:Item>Document.НачислениеОтпускаРаботникамОрганизаций</xr:Item>
				<xr:Item>Document.НачислениеПоБольничномуЛисту</xr:Item>
				<xr:Item>Document.НевыходыВОрганизациях</xr:Item>
				<xr:Item>Document.ОплатаПоСреднемуЗаработку</xr:Item>
				<xr:Item>Document.ОплатаПраздничныхИВыходныхДнейОрганизаций</xr:Item>
				<xr:Item>Document.ОплатаСверхурочныхЧасов</xr:Item>
				<xr:Item>Document.ПремииРаботниковОрганизаций</xr:Item>
				<xr:Item>Document.РасчетПриУвольненииРаботникаОрганизаций</xr:Item>
				<xr:Item>Document.РегистрацияПростоевВОрганизациях</xr:Item>
				<xr:Item>Document.РегистрацияРазовыхНачисленийРаботниковОрганизаций</xr:Item>
				<xr:Item>Document.ден_ВнутреннееПеремещениеНаличныхДенежныхСредств</xr:Item>
				<xr:Item>Document.КорректировкаСтоимостиСписанияТоваров</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СведенияСчетовФактурПолученных</xr:Item>
				<xr:Item>AccumulationRegister.ОПВПодлежитПеречислениюВФонды</xr:Item>
				<xr:Item>CalculationRegister.БУДополнительныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыОрганизацийСКонтрагентамиФизЛицами</xr:Item>
				<xr:Item>AccumulationRegister.ПогашениеЗаймовРаботниками</xr:Item>
				<xr:Item>AccumulationRegister.ден_ДенежныеСредстваКПолучению</xr:Item>
				<xr:Item>CalculationRegister.ДополнительныеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НДССИзмененнымСрокомУплаты</xr:Item>
				<xr:Item>AccumulationRegister.ПриходПерсоналаПоИсточникам</xr:Item>
				<xr:Item>AccumulationRegister.СведенияСчетовФактурВыданных</xr:Item>
				<xr:Item>AccumulationRegister.Акциз</xr:Item>
				<xr:Item>AccumulationRegister.ур_РеализацияЗерна</xr:Item>
				<xr:Item>AccumulationRegister.фин_КоэффициентыЭффективностиРаботыОтветственныхБюджетногоПроцесса</xr:Item>
				<xr:Item>AccumulationRegister.узп_ПланыЗакупок</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСДепонентамиОрганизаций</xr:Item>
				<xr:Item>CalculationRegister.УдержанияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВыпускПродукцииУслугБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПланыДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОППВРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.узп_ЗаявкиМТС</xr:Item>
				<xr:Item>AccumulationRegister.ден_ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ООСМСРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.фин_ЗначенияРасчетныхПоказателейЗаПериод</xr:Item>
				<xr:Item>AccumulationRegister.ПотребностиВОбучении</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеРабочиеМеста</xr:Item>
				<xr:Item>AccumulationRegister.ур_ЗабронированноеЗерно</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеШтатныеЕдиницыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ден_ЗаявкиНаРасходованиеСредств</xr:Item>
				<xr:Item>AccumulationRegister.ВыплаченныеДоходыРаботникамОрганизацийНУ</xr:Item>
				<xr:Item>AccumulationRegister.ИПНИсчисленный</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботниками</xr:Item>
				<xr:Item>AccumulationRegister.ден_РазмещениеЗаявокНаРасходованиеСредств</xr:Item>
				<xr:Item>AccumulationRegister.фин_ФактическиеОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.фин_МониторингНепринятияСтрокБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.узп_ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЦС_ИсполнениеПланаГЗ</xr:Item>
				<xr:Item>AccumulationRegister.ден_ДенежныеСредстваКСписанию</xr:Item>
				<xr:Item>AccumulationRegister.ИПНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизацийБУ</xr:Item>
				<xr:Item>AccumulationRegister.СНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.фин_ОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПервойПоловиныМесяца</xr:Item>
				<xr:Item>AccumulationRegister.НДСВзаиморасчетыСБюджетом</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ООСМССведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМССведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПредполагаемыеПоступленияПоБюджетам</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкаНДС</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПланируемыеПоступленияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ПланируемыеЗатратыНаПерсонал</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСРасчетыСФондами</xr:Item>
				<xr:Item>CalculationRegister.БУОсновныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.ФактическаяВыработкаРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ур_ЗерноНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаНМА</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.СОСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ВыпускПродукцииУслугНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.фин_МониторингКорректировок</xr:Item>
				<xr:Item>AccumulationRegister.ИПНРасчетыСБюджетом</xr:Item>
				<xr:Item>AccumulationRegister.фин_КонтролируемыеФинансовыеПоказатели</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.Удалить_фин_ОстаткиБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.НДСКВозмещению</xr:Item>
				<xr:Item>AccumulationRegister.ден_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.дог_ГрафикиПоставокПоДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.СведенияОбИсчисленииВычетовИПН</xr:Item>
				<xr:Item>AccumulationRegister.узп_ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ФактическаяВыработкаРаботников</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыОрганизацийСПолучателямиИЛ</xr:Item>
				<xr:Item>AccumulationRegister.ОПВСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОППВСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ИспользованиеОтпусковРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСПодлежитПеречислениюВФонды</xr:Item>
				<xr:Item>AccumulationRegister.ден_РезервыПоБюджетамПодВыполнениеЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.ПисьмаЭлектроннойПочты</xr:Item>
				<xr:Item>AccumulationRegister.РабочееВремяРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ден_ДенежныеСредстваВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСИсчисленные</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНаИсточникиПерсонала</xr:Item>
				<xr:Item>AccountingRegister.фин_Бюджетирование</xr:Item>
				<xr:Item>AccumulationRegister.СОРасчетыСФондами</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СНИсчисленный</xr:Item>
				<xr:Item>AccumulationRegister.дог_ИсполнениеДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.РеализацияТМЗ</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаНерезидента</xr:Item>
				<xr:Item>AccumulationRegister.НДС</xr:Item>
				<xr:Item>CalculationRegister.РасчетСреднегоЗаработка</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаОС</xr:Item>
				<xr:Item>AccumulationRegister.ПогашениеЗаймовРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПереоценкаВнеоборотныхАктивов</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкаНДСКВозмещению</xr:Item>
				<xr:Item>AccumulationRegister.ур_ДвиженияЗерна</xr:Item>
				<xr:Item>AccumulationRegister.фин_ПрогнозИсполненияБюджетов</xr:Item>
				<xr:Item>CalculationRegister.УправленческиеНачисления</xr:Item>
				<xr:Item>CalculationRegister.УправленческиеУдержания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/УдалитьОтчетПоНаличиюСчетовФактурПолученных/Ext/ObjectModule.bsl
#Если Клиент Тогда

Перем мСписокСтруктурныхЕдиниц Экспорт;

Функция ОпределитьНаличиеСчетовФактур(НачПериода = Неопределено, КонПериода = Неопределено, Организация, Фильтр = Неопределено, ВсеКромеФильтра = Ложь, НаличиеСчетаФактуры = Неопределено, ИмяСчетФактуры = "СчетФактураПолученный", ВалютаОтбора = Неопределено) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	  
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачПериода"    , НачПериода);
	Запрос.УстановитьПараметр("КонПериода"    , ?(НЕ ЗначениеЗаполнено(КонПериода),'00010101',КонецДня(КонПериода)));
	Запрос.УстановитьПараметр("Организация"   , Организация);
	Запрос.УстановитьПараметр("Фильтр"        , Фильтр);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ВалютаОтбора"  , ВалютаОтбора);
			
	// Дополняем условие запроса отбором по признаку наличия/отсутствия счета-фактуры
	УсловиеЗапроса = ?(НаличиеСчетаФактуры = Неопределено, "", " ГДЕ " + ?(НаличиеСчетаФактуры, "НЕ СчетФактура.Ссылка ЕСТЬ NULL", "СчетФактура.Ссылка ЕСТЬ NULL"));
	
	//добавим фильтр по типу регистратору, т.к. из регистров выбирается данные по документам,
	//которые не регситрируется счет-фактурой.
	СписокТиповДокументов = Новый СписокЗначений;
	МетаданныеДокумента = Документы[ИмяСчетФактуры].ПустаяСсылка().Метаданные();
	Для Каждого Документ Из МетаданныеДокумента.ТабличныеЧасти["ДокументыОснования"].Реквизиты["ДокументОснование"].Тип.Типы() Цикл
		ТипДокумента = Метаданные.НайтиПоТипу(Документ);
		СписокТиповДокументов.Добавить(ТипДокумента.Имя);
	КонецЦикла;		
	
	//признак добавление в условие соединительного "ИЛИ"
	НужноДобавлятьСоединение = Ложь;
	
	//Признак закртыия скобки после перечисления всех типов регистраторов
	НуженКонецСкобки        = Ложь;
	
	Если УсловиеЗапроса = "" Тогда 
		Если СписокТиповДокументов.Количество() > 0 Тогда
			УсловиеЗапроса = " ГДЕ ";				
		КонецЕсли;			
	Иначе
		УсловиеЗапроса = УсловиеЗапроса + "  И (";      			
		НуженКонецСкобки = Истина;
	КонецЕсли;
	
	Для Каждого ТипДок Из СписокТиповДокументов Цикл 			
		УсловиеЗапроса = УсловиеЗапроса + ?(НужноДобавлятьСоединение , " ИЛИ", "") + "  ЗапросПоДокументам.ДокументОснование ССЫЛКА Документ." + ТипДок.Значение;
		НужноДобавлятьСоединение = Истина;
	КонецЦикла;

	Если НуженКонецСкобки Тогда
		УсловиеЗапроса = УсловиеЗапроса + ")";
	КонецЕсли;
	 		
	ЗапросПоДокументам = "ВЫБРАТЬ
						|	НДС.Регистратор КАК ДокументОснование,
						|	НДС.Период КАК ДатаДокументаОснования,
						|	НДС.Контрагент,
						|	ВЫБОР
						|		КОГДА НДС.Регистратор ССЫЛКА Документ.Сторнирование
						|				ИЛИ НДС.Регистратор ССЫЛКА Документ.КорректировкаЗаписейРегистров
						|			ТОГДА &ВалютаРегУчета
						|		ИНАЧЕ НДС.Регистратор.ВалютаДокумента
						|	КОНЕЦ КАК ВалютаДокумента,
						|	НДС.СуммаНДС
						|ИЗ
						|	РегистрНакопления.<<ИмяРегистраНДС>> КАК НДС
						|ГДЕ
						|	НДС.Активность
						|	" + УчетНДСИАкциза.СформироватьУсловиеОграниченияПоПериоду("НДС.Период", НачПериода, КонПериода) +
						?(НЕ ЗначениеЗаполнено(Организация), "",  " И НДС.Организация В (&Организация) ") + 
						// Дополняем условие запроса отбором по документу-основанию или списку документов-оснований
						?(НЕ ЗначениеЗаполнено(Фильтр), "", " И НДС.Регистратор " + ?(ВсеКромеФильтра, " НЕ ", "") + " В (&Фильтр) ") +
						"
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	КорректировкаНДС.Регистратор КАК ДокументОснование,
						|	КорректировкаНДС.Период КАК ДатаДокументаОснования,
						|	КорректировкаНДС.Контрагент,
						|	ВЫБОР
						|		КОГДА КорректировкаНДС.Регистратор ССЫЛКА Документ.Сторнирование
						|				ИЛИ КорректировкаНДС.Регистратор ССЫЛКА Документ.КорректировкаЗаписейРегистров
						|				ИЛИ КорректировкаНДС.Регистратор ССЫЛКА Документ.СписаниеТоваров
						|			ТОГДА &ВалютаРегУчета
						|		ИНАЧЕ КорректировкаНДС.Регистратор.ВалютаДокумента
						|	КОНЕЦ,
						|	КорректировкаНДС.СуммаНДС
						|ИЗ
						|	РегистрНакопления.<<ИмяРегистраКорректировкаНДС>> КАК КорректировкаНДС
						|ГДЕ
						|	КорректировкаНДС.Активность 
						|	" + УчетНДСИАкциза.СформироватьУсловиеОграниченияПоПериоду("КорректировкаНДС.Период", НачПериода, КонПериода) +
						?(НЕ ЗначениеЗаполнено(Организация), "",  " И КорректировкаНДС.Организация В (&Организация) ") + 
						// Дополняем условие запроса отбором по документу-основанию или списку документов-оснований
						?(НЕ ЗначениеЗаполнено(Фильтр), "", " И КорректировкаНДС.Регистратор " + ?(ВсеКромеФильтра, " НЕ ", "") + " В (&Фильтр) ");
					
	// В зависимости от параметра ИмяСчетФактуры = "СчетФактураПолученный" заменяем имена базовых регистов
	ЗапросПоДокументам = СтрЗаменить(ЗапросПоДокументам, "<<ИмяРегистраНДС>>", ?(ИмяСчетФактуры = "СчетФактураПолученный", "НДСКВозмещению", "НДС"));
	ЗапросПоДокументам = СтрЗаменить(ЗапросПоДокументам, "<<ИмяРегистраКорректировкаНДС>>", ?(ИмяСчетФактуры = "СчетФактураПолученный", "КорректировкаНДСКВозмещению", "КорректировкаНДС"));
	
	ЗапросПоДокументам = "ВЫБРАТЬ
	                     |	ЗапросПоДокументам.ДокументОснование,
	                     |	ЗапросПоДокументам.ДатаДокументаОснования,
	                     |	ЗапросПоДокументам.Контрагент,
	                     |	ЗапросПоДокументам.ВалютаДокумента,
	                     |	СУММА(ЗапросПоДокументам.СуммаНДС) КАК СуммаНДС
	                     |ИЗ
	                     |	(" + ЗапросПоДокументам + ") КАК ЗапросПоДокументам
	                     |	" + ?(НЕ ЗначениеЗаполнено(ВалютаОтбора), "", " ГДЕ ЗапросПоДокументам.ВалютаДокумента = &ВалютаОтбора") + "
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЗапросПоДокументам.ДокументОснование,
	                     |	ЗапросПоДокументам.ДатаДокументаОснования,
	                     |	ЗапросПоДокументам.Контрагент,
	                     |	ЗапросПоДокументам.ВалютаДокумента";
	
	Запрос.Текст = Запрос.Текст +
	"Выбрать РАЗРЕШЕННЫЕ
	|	ЗапросПоДокументам.ДокументОснование КАК ДокументОснование,
	|	ЗапросПоДокументам.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ЗапросПоДокументам.Контрагент КАК Контрагент,
	|	ЗапросПоДокументам.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗапросПоДокументам.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СчетФактура.Ссылка,Неопределено) КАК СчетФактура,
	|	ЕСТЬNULL(СчетФактура.Ссылка.Проведен, ЛОЖЬ) КАК СчетФактураПроведен
	|ИЗ(" + ЗапросПоДокументам +")КАК ЗапросПоДокументам					
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СчетФактура.Ссылка КАК Ссылка,
	|			СчетФактура.ДокументОснование КАК ДокументОснование
	|		ИЗ
	|			Документ."+ ИмяСчетФактуры + ".ДокументыОснования КАК СчетФактура) КАК СчетФактура
	|		ПО ЗапросПоДокументам.ДокументОснование = СчетФактура.ДокументОснование  
	| " + УсловиеЗапроса + "
	| УПОРЯДОЧИТЬ ПО ЗапросПоДокументам.ДатаДокументаОснования ";
			
	Запрос.Текст =  Запрос.Текст;
			
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
		
КонецФункции // ОпределитьНаличиеСчетовФактур()

// Процедура формирует табличный документ с отчетом по наличию счетов-фактур.
//
// Параметры:
//  ДокументРезультат - табличный документ, в который выводится
//                      отчет по наличию счетов-фактур
//  ТаблицаРезультат - таблица значений, содержащая данные для построения
//                     отчета
//
// Возвращаемое значение:
//  Нет.
//
Процедура СформироватьОтчетПоНаличиюСчетовФактур(ДокументРезультат, ТаблицаРезультат) Экспорт
	
	ДокументРезультат.Очистить();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСверху         = 10;
	ДокументРезультат.ПолеСнизу          = 10;
	ДокументРезультат.ПолеСлева          = 20;
	ДокументРезультат.ПолеСправа         = 20;
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПоНаличиюСчетовФактур";
	
	// Получим макет и области макета.
	Макет = ПолучитьМакет("ОтчетПоНаличиюСчетовФактур");
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
	Шапка           = Макет.ПолучитьОбласть("Шапка");
	Строка          = Макет.ПолучитьОбласть("Строка");
	Подвал          = Макет.ПолучитьОбласть("Подвал");
	
	// Выведем заголовок отчета.
			
	ЗаголовокОтчета.Параметры.НаименованиеОрганизации = РаботаСДиалогами.ВыгрузитьСписокВСтроку(мСписокСтруктурныхЕдиниц);
		
	Если ЗначениеЗаполнено(НачалоПериода) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		ЗаголовокОтчета.Параметры.ОписаниеПериода = "С " + Формат(НачалоПериода, "ДЛФ=DD");
	ИначеЕсли НЕ ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		ЗаголовокОтчета.Параметры.ОписаниеПериода = "По " + Формат(КонецПериода, "ДЛФ=DD");
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		ЗаголовокОтчета.Параметры.ОписаниеПериода = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП=Истина");
	Иначе
		ЗаголовокОтчета.Параметры.ОписаниеПериода = "(Без ограничения периода)";
	КонецЕсли;
		
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	// Выведем шапку таблицы.
	ДокументРезультат.Вывести(Шапка);
	
	// Выведем строки таблицы.
	Для Каждого СтрокаРезультат Из ТаблицаРезультат Цикл
		
		Строка.Параметры.Заполнить(СтрокаРезультат);
		
		Строка.Параметры.СчетФактураПроведен = ?(СтрокаРезультат.СчетФактураПроведен = Истина, "●", "");
		
		Строка.Параметры.НомерСтроки = ТаблицаРезультат.Индекс(СтрокаРезультат) + 1;
		
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(Строка);
		СтрокаСПодвалом.Добавить(Подвал);

		Если НЕ УниверсальныеМеханизмы.ПроверитьВыводДляТабличногоДокумента(ДокументРезультат, СтрокаСПодвалом) Тогда
			
			ДокументРезультат.Вывести(Подвал);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(Шапка);
			
		КонецЕсли;
		
		ДокументРезультат.Вывести(Строка);
		
	КонецЦикла;

	ДокументРезультат.Вывести(Подвал);
	
	ДокументРезультат.ТолькоПросмотр = Истина;
	
КонецПроцедуры // СформироватьОтчетПоНаличиюСчетовФактур()

#КонецЕсли
